package com.dubbo.error;

public enum ErrorCode {

        /*Account-service 错误码-预留字段*/
        ACS_10001,
        ACS_10002,
        ACS_10003,
        ACS_10004,
        ACS_10005,
        ACS_10006,
        ACS_10007,
        ACS_10008,
        ACS_10009,

        /*Account-service 错误码-业务字段*/
        ACS_20001,
        ACS_20002,
        ACS_20003,
        ACS_20004,
        ACS_20005,
        ACS_20006,
        ACS_20007,
        ACS_20008,
        ACS_20009,

        /* Account-service 错误码-业务字段 */
        ACS_30001,//业务中传参，丢参异常
        ACS_30002,//数据非法
        ACS_30003,//非法操作项目
        ACS_30004,//数据库数据不存在
        ACS_30005,//数据已经改变
        ACS_30006,//状态字段传递错误 status字段状态
        ACS_30007,//夸月取消订单异常
        ACS_30008,//订单都在审核中
        ACS_30009,//取消订单异常
        ACS_30010,//商品类别为空
        ACS_30011,//商品同步数据失败
        ACS_30012,//定是任务顺延出错
        ACS_30013,//续费逻辑出错
        ACS_30014,//续费费用不足
        ACS_30015,//续费时，老师没有所授的学科
        ACS_30016,//判断账号状态角色
        ACS_30018,//老师状态
        ACS_30019,//机构编码被使用
        ACS_30020,//没有选择地区
        ACS_30021,//手机号已经被使用
        ACS_30022,//flow机构已经存在审批流程
        ACS_30023,//签约消息被修改
        ACS_30024,//机构尚未合作
        ACS_30025,//该机构已是独家机构
        ACS_30026,//页数必须是大于0的数字 每页显示条数必须大于0
        ACS_30027,//机构签约金额异常
        ACS_30028,//折后最低应付金额异常
        ACS_30029,//标准最低应付金额异常
        ACS_30030,//机构相关数据已存在
        ACS_30031,//在线签约异常
        ACS_30032,//发货短信通知
        ACS_30033,//订单物流刷新错误
        ACS_30034,//库存查询异常


        ACS_31000,//特殊充值操作错误
        ACS_31001,//特殊充值爱豆数量错误

        ACS_32001,//特殊扣款操作错误
        ACS_32002,//特殊扣款爱豆数量错误

        ACS_33001,//图书退费操作错误



        /* Account-service 数据异常异常 */
        ACS_40001,//调用失败
        ACS_40002,//解析Xml异常
        ACS_40003,//机构续费日前定时任务出错
        ACS_40004,//
        ACS_40005,//
        ACS_40006,//
        ACS_40007,//
        /* Account-service 第三方抛出的异常 */
        ACS_50001,//第三方异常
        ACS_50002,//IOException
        ACS_50003,//发网异常
        ACS_50004,//物流信息异常
        ACS_50005,//发网订单异常
        ACS_50006,//运算接口异常
        ACS_50007,//发网库存接口异常
        /* Account-service */
        ACS_60001,//未知异常
        /* Account-service */
        ACS_70001,//工具类异常
        ACS_70002,//工具类类型转换异常






        /*预留字段*/
        SK_10001,
        SK_10002,
        SK_10003,
        SK_10004,
        SK_10005,
        SK_10006,
        SK_10007,
        SK_10008,
        SK_10009,

        SK_20001,
        SK_20002,
        SK_20003,
        SK_20004,
        SK_20005,
        SK_20006,
        SK_20007,
        SK_20008,
        SK_20009,
        /* 业务异常 */
    /**
     * 学生信息不为空
     */
    SK_30001,
    /**
     * 班级ID不能为空
     */
    SK_30002,
    /**
     * 讲次ID不能为空
     */
    SK_30003,
    /**
     * 学生ID不能为空
     */
    SK_30004,
    /**
     * 分数来源不能为空
     */
    SK_30005,
    /**
     * 分数类型不能为空
     */
    SK_30006,
    /**
     * 分数不能为空
     */
    SK_30007,
    /**
     * 描述不能为空
     */
    SK_30008,
    /**
     *讲次信息
     */
    SK_30009,
    /**
     *班级信息
     */
    SK_30010,
    /**
     * 学生编码不能为空
     */
    SK_30011,
    /**
     * 作业ID不能为空
     */
    SK_30012,
    /**
     * 非法参数
     */
    SK_30013,
    /**
     * 已经提交点名
     */
    SK_30014,
    /**
     * 学生ID集合的长度
     */
    SK_30015,
    /**
     * 机构ID
     */
    SK_30016,
    /**
     * 异常名称
     */
    SK_30017,
    /**
     * 用户姓名
     */
    SK_30018,
    /**
     * 查询班级为空
     */
    SK_30019,
    /**
     * 年级ID为空
     */
    SK_30020,
    /**
     * 学科ID为空
     */
    SK_30021,
    /**
     * 班级类型ID
     */
    SK_30022,
    /**
     * 讲次为空
     */
    SK_30023,
    /**
     * 讲次信息为空
     */
    SK_30024,
    /**
     * 学生姓名不能为空
     */
    SK_30025,
    /**
     * 学生家长一的手机号不能为空
     */
    SK_30026,
    /**
     * 密码不能为空
     */
    SK_30027,
    /**
     * 账号或密码错误
     */
    SK_30028,
    /**
     * 账号已失效
     */
    SK_30029,
    /**
     * 家长信息
     */
    SK_30030,
    /**
     * 用户ID
     */
    SK_30031,
    /**
     * 查询机构
     */
    SK_30032,
    /**
     * 班级机构id与学生机构id不相同
     */
    SK_30033,
    /**
     * 创建者id不能为空
     */
    SK_30034,
    /**
     * classRefStuTeaId ID
     */
    SK_30035,
    /**
     * 加入班级类型
     */
    SK_30036,

        /* 数据异常异常 */
        SK_40001,//链接超时
        SK_40002,//主键冲突
        SK_40003,//语法错误
    /**
     * 未知异常
     */
    SK_50001,

        /**
         * 位置异常
         */
        G_100001,
    /**
     * 用户信息失效
     */
    G_10002,
    /**
     * 参数长度过长
     */
    G_10003,
    /**
     * 参数长度太短
     */
    G_10004,
    /**
     * 参数不能为空
     */
    G_10005,
    /**
     * 服务调用失败
     */
    G_10006,
    /*xuexiao-service 业务异常*/

    /**
     * 系统消息失效
     */
    G_10007,
    /**
     * 个推服务器异常
     */
    G_10008,
    /**
     * 未登录.
     */
    G_10009,
        /*xuexiao-service 业务异常*/
        XSO_30001,//参数班级信息为空
        XSO_30002,//参数学生信息为空
        XSO_30003,//学生信息有误 学生状态被禁用
        XSO_30004,//班级id参数为空
        XSO_30005,//学生名称参数为空
        XSO_30006,//电话参数为空
        XSO_30007,//根据班级编码未得到正确的班级信息
        XSO_30008,//根据原班号未得到正确的班级信息
        XSO_30009,//rest:未找到班级信息
        XSO_30010,//参数机构id为空
        XSO_30011,//未得到机构信息
        XSO_30012,//该机构不是试用机构,不能创建试用账号
        XSO_30013,//创建试用账号:该手机号已存在
        XSO_30014,//创建试用账号:该手机号教师已经存在
        XSO_30015,//未找到用户信息
        XSO_30016,//未找到教师信息
        XSO_30017,//用户:该手机号已被占用
        XSO_30018,//教师:该手机号已经被占用
        XSO_30019,//该用户为管理员或者超级管理员
        XSO_30020,//营销资料名字错误

        /*xuexiao-service 未知异常*/
        XSO_50001,//班级类型转换异常
        XSO_50002,//学生类型转换异常

        /*xuexiao-web 业务异常*/
        XWO_30001,//导入模板有误
        XWO_30002,//解析Excel失败，请上传xls或xslx格式的文件
        XWO_30003,//资源id参数错误
        XWO_30004,//参数sessionId为空
        XWO_30005,//请选择Excel文件

        /*xuexiao-web 系统异常 未知异常*/
        XWO_50000,//系统异常
        XWO_50001,//系统找不到指定路径
        XWO_50002,//下载文件失败，未找到文件
        XWO_50003,//读取excel错误



    /* 业务异常 */
    /***没有讲次详情权限**/
    BKS_30000,
    /***手机号为空**/
    BKS_30001,
    /***讲次ID为空**/
    BKS_30002,
    /**版本不能为空**/
    BKS_30003,
    /**课件类型为空**/
    BKS_30004,
    /***班型ID为空**/
    BKS_30005,
    /**科目ID为为空**/
    BKS_30006,
    /***学期为为空**/
    BKS_30007,
    /**年级ID为空**/
    BKS_30008,
    /**数据不存在***/
    BKS_30009,
    /**教材版本ID为空***/
    BKS_30010,
    /**课时ID为空***/
    BKS_30011,
    /**BookVersionServiceImpl中sendSms参数为空***/
    BKS_30012,
    /**学科产品ID为空**/
    BKS_30013,
    /**数据已存在**/
    BKS_30014,
    /**课程介绍单选按钮为空***/
    BKS_30015,
    /**没有管理员权限***/
    BKS_30016,
    /***学科下没有教材版本**/
    BKS_30017,
    /* 数据异常异常 */
    BKS_40001,//链接超时
    BKS_40002,//主键冲突
    BKS_40003,//语法错误
    /* 未知异常 */
    BKS_50001,


    /* 业务异常 */
    /***参数非法**/
    BK_30001,
    /**数据不存在***/
    BK_30002,
    /**没有权限***/
    BK_30003,
    /**非法请求**/
    BK_30004,
    /**邮件发送失败**/
    BK_30005,
    /**班型ID为空**/
    BK_30006,
    /***机构ID为空***/
    BK_30007,
    /***教师编码为空**/
    BK_30008,
    /***用户没有打印权限***/
    BK_30009,
    /****otherPrintUser为空***/
    BK_30010,
    /***非全部语文***/
    BK_30011,
    /**未找到讲义信息**/
    BK_30012,
    /**resuleDate返回状态0***/
    BK_30013,
    /**手机号为空**/
    BK_30014,
    /**用户编码为空***/
    BK_30015,
    /***学期id不能为空**/
    BK_30016,
    /***用户没有该班型**/
    BK_30017,
    /**讲次id为空**/
    BK_30018,
    /****文件目录不存在**/
    BK_30019,
    /***文件类型为空**/
    BK_30020,
    /***文件不存在**/
    BK_30021,
    /***登录编码为空**/
    BK_30022,
    /**没有教师权限***/
    BK_30023,




    /*数据异常异常 */
    BK_40001,//链接超时
    BK_40002,//主键冲突
    BK_40003,//语法错误
    /*未知异常 */
    BK_50001,

    /* front 异常*/
    FRONT_30001, //试题选项不能为空
    FRONT_30002, //评析内容不能为空
    FRONT_30003, //评析的版本不能为空
    FRONT_30004, //查询评析列表时,analysisParentId 所属学科学段的id为空
    FRONT_30005, //保存评析时，analysisParent 为空
    FRONT_30006, //批量保存评析时，评析内容为空
    FRONT_30007, //保存高思杯设置时，为空
    FRONT_30008, //查找高思杯设置，参数id为空
    FRONT_30009, //最新版本的知识点分类时，参数异常
                 //
    FRONT_30011, //试题为空
    FRONT_30012, //试题难度为空
    FRONT_30013, //知识点分类的id为空
    FRONT_30014, //知识点分类为空
    FRONT_30015, //保存学生测评答案时，对应机构id为空
    FRONT_30016, //保存学生测评答案时，testPaterId为空
    FRONT_30017, //保存学生测评答案时，version为空
    FRONT_30018, //学生答案为空 studentPaper.getStudentAnswers()
    FRONT_30019, //查找的学生测评答案为空
    FRONT_30020, //查找学生答案信息时，参数id为空
    FRONT_30021, //获取学生测评报告，报告为空
    FRONT_30022, //获取学生测评报告，获取到的试卷实体为空
    FRONT_30023, //获取学生测评报告，试卷题目为空
    FRONT_30024, //获取学生测评报告，试卷题目组为空
    FRONT_30025, //获取学生测评报告，知识点为空
    FRONT_30026, //获得做题评论信息，试卷（testPaper）内容为空
    FRONT_30027, //查询学生测评历史为空
    FRONT_30028, //编辑试卷题目组时，试卷题目组为空
    FRONT_30029, //操作试卷题目组时，参数id为空
    FRONT_30030, //查询试卷testPaper时，参数id为空
    FRONT_30031, //试卷 version 为空
    FRONT_30032, //查询、修改或保存试卷TestPaper时，试卷为空
    FRONT_30033, //参数不完整  BaseDataServiceImpl
    FRONT_30034, //查询学科为空
    FRONT_30035, //查询学期为空
    FRONT_30036, //查询学生答案信息为空
    FRONT_30037, //查询学生报告为空
    FRONT_30038, //删除学生测评答案时，参数异常
    FRONT_30039, //导出证书时，参数异常
    FRONT_30040, //无证书可导出
    FRONT_30041, //查询试卷分页信息 为空
    FRONT_30042, //保存TestPaper失败
    FRONT_30043,  //查询试卷信息，参数异常




        /*预留字段*/
    CSO_10001,
    CSO_10002,
    CSO_10003,
    CSO_10004,
    CSO_10005,
    CSO_10006,
    CSO_10007,
    CSO_10008,
    CSO_10009,
        /* 业务异常*/

    CSO_20001,
    CSO_20002,
    CSO_20003,
    CSO_20004,
    CSO_20005,
    CSO_20006,
    CSO_20007,
    CSO_20008,
    CSO_20009,
        /* 业务异常 */
    /**
     * token不存在
     */
    CSO_30001 ,
    /**
     * token非法
     */
    CSO_30002 ,
    /**
     * 用户名和密码为空.
     */
    CSO_30003 ,
    /**
     * 用户名或验证码为空.
     */
    CSO_30004 ,
    /**
     * 用户不存在.
     */
    CSO_30005 ,
    /**
     * 密码错误.
     */
    CSO_30006 ,
    /**
     * 手机格式错误.
     */
    CSO_30007 ,
    /**
     * 验证码和密码同时为空.
     */
    CSO_30008 ,
    /**
     * 用户名为空.
     */
    CSO_30009 ,
    /**
     * 登录密码为空.
     */
    CSO_30010 ,
    /**
     * 验证码为空.
     */
    CSO_30011 ,

    /**
     * 数据异常异常
     * /
    CSO_40001,
    CSO_40002,//主键冲突
    CSO_40003,//语法错误
        /* 未知异常 */
    CSO_50001,

    /**数据同步服务异常定义区*/
    /**
     * 学生编码不能为空
     */
    DATA_SYNC_STUDENT_CODE_NOT_NULL,
    /**
     * 未找到学生信息
     */
    DATA_SYNC_STUDENT_NOT_FOUND,
    /**
     * 根据机构编码未找到机构信息
     */
    DATA_SYNC_INSTITUTION_NOT_FOUND,

    /**
     * 根据班型id和讲次数未找到讲次信息
     */
    DATA_SYNC_LESSON_NOT_FOUND,
    /**
     * 未找到课表信息
     */
    DATA_SYNC_SCHEDULE_NOT_FOUND,
    /**
     * 未找到老师信息
     */
    DATA_SYNC_TEACHER_NOT_FOUND,
    /**
     * 老师状态不能为空
     */
    DATA_SYNC_TEACHER_STATUS_NOT_NULL,
    /**
     * 老师编码不能为空
     */
    DATA_SYNC_TEACHER_CODE_NOT_NULL,
    /**
     * 老师手机号不能为空
     */
    DATA_SYNC_TEACHER_TELEPHONE_NOT_NULL,
    /**
     * 老师真实姓名不能为空
     */
    DATA_SYNC_TEACHER_TRUTH_NAME_NOT_NULL,
    /**
     * 未找到班型
     */
    DATA_SYNC_CLASS_TYPE_NOT_FOUND,
    /**
     * 未找到班级
     */
    DATA_SYNC_CLASS_NOT_FOUND,
    /**
     * 班级讲次数过大
     */
    DATA_SYNC_CLASS_LESSON_NO_TOO_MUCH,

    /**
     * 期中测评非法的测评类型参数
     */
    EXAM_ILLEGAL_PARAM_EXAM_TYPE,
    /**
     * 助教信息找不到
     */
    ASSISTANT_NOT_FOUNT,
    /**
     * 非法参数难度
     */
    EXAM_ILLEGAL_PARAM_DIFFICULT,
    /**
     * 非法参数
     */
    EXAM_ILLEGAL_PARAM_PERIOD,
    /**
     * 题目总分不能为空
     */
    EXAM_TOPIC_TOTAL_SCORE_NOT_NULL,
    /**
     * 未找到班型
     */
    EXAM_CLASS_TYPE_NOT_FOUND,
    /**
     * 未找到机构班型试卷
     */
    EXAM_INSTITUTION_CLASS_TYPE_EXAM_NOT_FOUND,
    /**
     * 班级试卷未找到
     */
    EXAM_CLASS_EXAM_NOT_FOUND,
    /**
     * 学生试卷未找到
     */
    EXAM_STUDENT_EXAM_NOT_FOUND,
    /**
     * 未找到班级
     */
    EXAM_CLASS_NOT_FOUND,
    /**
     * 未找到年级
     */
    EXAM_GRADE_NOT_FOUND,
    /**
     * 未找到学科
     */
    EXAM_SUBJECT_PRODUCT_NOT_FOUND,
    /**
     * 未找到讲次信息
     */
    EXAM_LESSON_NOT_FOUND,
    /**
     * 未找到机构信息
     */
    EXAM_INSTITUTION_NOT_FOUND,
    /**
     * 文件未找到
     */
    EXAM_FILE_NOT_FOUND,
    /**
     * 年级不匹配
     */
    EXAM_GRADE_NOT_MATCH,
    /**
     * 学科不匹配
     */
    EXAM_SUBJECT_PRODUCT_NOT_MATCH,
    /**
     * 机构不匹配
     */
    EXAM_INSTITUTION_NOT_MATCH,

    /* 访问限制异常 */
    ACF_30001, //访问频率限制
    ACF_30002, //重入限制
    ACF_30003, //访问权限限制

    /**
     * 机构id为空
     */
    FREE_30001,
    /**
     * 数据为空
     */
    FREE_30002,
    /**
     * 用户信息为空
     */
    FREE_30003,
    /**
     * 教师信息为空
     */
    FREE_30004,
    /**
     * 用户角色为空
     */
    FREE_30005,
    /**
     * 用户帐号为空
     */
    FREE_30006,
    /**
     * 用户姓名为空
     */
    FREE_30007,
    /**
     * 年级信息为空
     */
    FREE_30008,
    /**
     * 学科信息为空
     */
    FREE_30009,
    /**
     * 打印权限为空
     */
    FREE_30010,
    /**
     * 创建者id不能为空
     */
    FREE_30011,
    /**
     * 性别不能为空
     */
    FREE_30012,
    /**
     * 暂时没有免费帐号
     */
    FREE_30013,
    /**
     * 手机号已存在
     */
    FREE_30014,
    /**
     *  位置异常
     */
    FREE_50001,



    /****高思定制版错误码****/
    /***
     *北京返回参数异常
     */
    BXDZ_30000,
    /**
     * 年级ID不能为空
     */
    BXDZ_30001,
    /**
     * 学期ID不能为空
     */
    BXDZ_30002,
    /**
     * 学科ID不能为空
     */
    BXDZ_30003,
    /**
     * 年份不能为空
     */
    BXDZ_30004,
    /**
     * 是否包含不能为空
     */
    BXDZ_30005,
    /**
     * 班型编码不能为空
     */
    BXDZ_30006,
    /**
     * 学生编码不能为空
     */
    BXDZ_30007,
    /**
     * 班级不能为空
     */
    BXDZ_30008,
    /**
     * 北校异常信息异常
     */
    BXDZ_30009,
    /**
     * 订单编码不能为空
     */
    BXDZ_30010,
    /**
     * trade_no不能为空
     */
    BXDZ_30011,
    /**
     * totalFee不能为空
     */
    BXDZ_30012,
    /**
     * appid不能为空
     */
    BXDZ_30013,
    /**
     * mchId不能为空
     */
    BXDZ_30014,
    /**
     * 姓名不能为空
     */
    BXDZ_30015,
    /**
     * 生日不能为空
     */
    BXDZ_30016,
    /**
     * 性别不能为空
     */
    BXDZ_30017,
    /**
     * 手机号不能为空
     */
    BXDZ_30018,
    /**
     * 验证码不能为空
     */
    BXDZ_30019,
    /**
     * 密码不能为空
     */
    BXDZ_30020,
    /**
     * 匹配验证码错误
     */
    BXDZ_30021,
    /**
     * dubbo服务超时
     */
    BXDZ_30022,
    /**
     * 手机号输入错误
     */
    BXDZ_30023,
    /**
     * 分流ID
     */
    BXDZ_30024,
    /**
     * openId不能为空
     */
    BXDZ_30025,
    /**
     * clientIp不能为空
     */
    BXDZ_30026,
    /**
     * 入参不能为空
     */
    BXDZ_30027,
    /**
     * payId不能为空
     */
    BXDZ_30028,
    /**
     * 支付方式不存在
     */
    BXDZ_30029,
    /**
     * 版本检测更新异常
     */
    BXDZ_30030,
    /**
     * 当前版本不存在或者当前版本失效并且没有新版本
     */
    BXDZ_30031,
    /**
     * 版本重复
     */
    BXDZ_30032,
    /**
     * 原班级编码不能为空.
     */
    BXDZ_30033,
    /**
     * 讲次不能为空.
     */
    BXDZ_30034,
    /**
     *
     */
    BXDZ_30035,
    /**
     * 听课证号不能为空.
     */
    BXDZ_30036,
    /**
     * 讲次不能为空.
     */
    BXDZ_30037,
    /**
     * 区分是否是一元班
     */
    BXDZ_30038,
    /**
     * 学生提交答案数组
     */
    BXDZ_30039,
    /**
     * 北校活动编码不能为空.
     */
    BXDZ_30040,
    /**
     * 试卷的Id为空.
     */
    BXDZ_30041,
    /**
     * 优惠信息为空
     */
    BXDZ_30042,

    /**
     * 北校错误
     */
    BXDZ_40001,


    /**
     * 未定义异常
     */
    BXDZ_50001,
    /**
     * 短信服务预留字段
     */
    SMS_10001,
    /**
     * 短信服务预留字段.
     */
    SMS_20001,
    /**
     * 短信服务错误码.
     */
    SMS_30001,
    /**
     * Tooken验证错误,请重新确认.
     */
    SMS_30002,
    /**
     * 邮件内容为空,请重新确认.
     */
    SMS_30003,

    SMS_30004,
    SMS_30005,
    SMS_30006,
    SMS_30007,
    SMS_30008,
    SMS_30009,
    /**
     * 短信错误业务逻辑字段.
     */
    SMS_40001,
    /**
     * 短信后台数据错误.
     */
    SMS_50001,
    /**
     * C端错误预留字段.
     */
    CUS_10001,
    /**
     * C端预留.
     */
    CUS_20001,
    /**
     * appId为空.
     */
    CUS_30001,
    /**
     * studentId为空.
     */
    CUS_30002,
    /**
     * source不能为空.
     */
    CUS_30003,
    /**
     * type.
     */
    CUS_30004,
    /**
     * score
     */
    CUS_30005,
    /**
     * 非法积分类型
     */
    CUS_30006,
    /**
     * subjectProductId为空.
     */
    CUS_30007,
    /**
     * 错题数量为空.
     */
    CUS_30008,
    /**
     * questionId为空.
     */
    CUS_30009,
    /**
     * 课堂报告或者解答题报告区分标示为空.
     */
    CUS_30010,
    /**
     * 老师Id为空.
     */
    CUS_30011,
    /**
     * 不存在学生信息
     */
    CUS_30012,
    /**
     * 报告Id为空.
     */
    CUS_30013,
    /**
     * 班级Id.
     */
    CUS_30014,
    /**
     * 课堂报告为空.
     */
    CUS_30015,
    /**
     * 班级消息不存在.
     */
    CUS_30016,
    /**
     * 讲次Id为空.
     */
    CUS_30017,
	 /**
     * 试题正确答案为空.
     */
    CUS_30018,
     /**
     * 讲次作业内容为空.
     */
    CUS_30019,
    /**
     * 讲次作业为空.
     */
    CUS_30020,
    /**
     * 班型为空.
     */
    CUS_30021,
    /**
     * 讲次作业答案内容为空
     */
    CUS_30022,
    /**
     * 驳回的作业为空
     */
    CUS_30023,
    /**
     * 课堂报告发送失败.
     */
    CUS_30024,
    /**
     * 消息标题为空.
     *
     *
     *
     */
    CUS_30025,
    /**
     * 消息文本为空.
     */
    CUS_30026,
    /**
     * 消息别名Id为空.
     */
    CUS_30027,
    /**
     * 驳回答案提交为空.
     */
    CUS_30028,


    /**
     * 上传图片失败.
     */
    CUS_30029,
    /**
     * 删除图片失败，云服务器上找不到该图片.
     */
    CUS_30030,
    /**
     * 调用题库服务失败.
     */
    CUS_30031,
    /**
     * 作业ID为空.
     */
    CUS_30032,
    /**
     * topicId为空.
     */
    CUS_30033,
    /**
     *学生提交答案为空.
     */
    CUS_30034,
    /**
     * 题库查询数据为NULL.
     */
    CUS_30035,
     /**
     * 查询不到错题.
     */
    CUS_30036,
    /**
     * 上传图片Base64解码失败.
     */
    CUS_30037,
    /**
     * 学科名称为空.
     */
    CUS_30038,
    /**
     * 绑定clientId失败
     */
    CUS_30039,
    /**
     * 上传图片至阿里云失败.
     */
    CUS_30040,
    /**
     * 通过阿里云生成图片的访问url失败.
     */
    CUS_30041,
    /**
     * 没有学生可以推送.
     */
    CUS_30042,
    /**
     * 已砸蛋.
     */
    CUS_30043,
    /**
     * 无效的平台用户.
     */
    CUS_30044,
    /**
     * 时间类型转换异常.
     */
    CUS_30045,
    /**
     * 学生Id为空.
     */
    CUS_30046,
    /**
     * 设备Id为空.
     */
    CUS_30047,
    /**
     * 进门考报告参数为空.
     */
    CUS_30048,
    /**
     * 进门考学生信息为空.
     */
    CUS_30049,
    /**
     * 此用户没有续费.
     */
    CUS_30050,
    /**
     * 无此学员.
     */
    CUS_30051,
    /**
     * 没有错题.
     */
    CUS_30052,
    /**
     * 调用加积分服务异常
     */
    CUS_30053,
    /**
     * 查询c_student_homework数据为空
     */
    CUS_30054,
    /**
     * 查询c_student_homework_record数据为空 
     */
    CUS_30055,
    /**
     * 学生总积分为空
     */
    CUS_30056,
    /**
     * 双师班级为空
     */
    CUS_30057,
    /**
     * 班级讲次报告为空
     */
    CUS_30058,
    /**
     * 用户无权访问.
     */
    CUS_30059,
    /**
     * 调用组卷返回错误
     */
    CUS_30060,
    /**
     * 试卷Id不能为空.
     */
    CUS_30061,

    /**
     * 作业中的题目为空
     */
    CUS_30062,
    /**
     * 传入的ID和查询的不一致
     */
    CUS_30063,
    /**
     * 学生作业答案数据错误
     */
    CUS_30064,
    /**
     * 订正重复提交.
     */
    CUS_30065,
     /**
	 *
     * C端业务逻辑错误.
     */
    CUS_40001,
    /**
     * C端系统错误字段.
     */
    CUS_50001,

    /**
     * 用户没有登录
     */
    AU_20001,
    /**
     * 无权限
     */
    AU_20002,
    /**
     * 用户不存在
     */
    AU_20003,
    /**
     * 用户名或密码错误
     */
    AU_20004,
    /**
     * 用户已经存在
     */
    AU_20005,

    /**
     * 教师端全局异常
     */
    SSK_50001,
    /**
     * 老师id不能为空
     */
    SSK_30001,
    /**
     * classId 不能为空
     */
    SSK_30002,
    /**
     * lessonId 不能为空
     */
    SSK_30003,
    /**
     * studentId 不能为空
     */
    SSK_30004,
    /**
     * scoreType 不能为空
     */
    SSK_30005,
    /**
     * score 不能为空
     */
    SSK_30006,
    /**
     * questionId 不能为空
     */
    SSK_30007,
    /**
     * 课表的开始时间不能早于当前
     */
    SSK_30008,
    /**
     * factorKey 不能为空
     */
    SSK_30009,
    /**
     * 天不能为空
     */
    SSK_30010,
    /**
     * 天格式错误
     */
    SSK_30011,
    /**
     * lessonNo 不能为空
     */
    SSK_30012,
    /**
     * 开始时间不能为空
     */
    SSK_30013,
    /**
     * 结束时间不能为空
     */
    SSK_30014,
    /**
     * 是否全部更新不能为空
     */
    SSK_30015,
    /**
     * 时间格式不对
     */
    SSK_30016,
    /**
     * 是否是创建班级不能为空
     */
    SSK_30017,
    /**
     * 页码不能为空
     */
    SSK_30021,
    /**
     * 每页大小不能为空
     */
    SSK_30022,
    /**
     * class_lesson_task_id 不能为空
     */
    SSK_30023,
    /**
     * task_factor_id 不能为空
     */
    SSK_30024,
    /**
     * 状态不能为空
     */
    SSK_30025,
    /**
     * 教师和助教id不能同时为空
     */
    SSK_30026,
    /**
     * 助教id不能为空
     */
    SSK_30027,
    /**
     * 未找到助教信息
     */
    SSK_30028,
    /**
     * 未找到老师信息
     */
    SSK_40001,
    /**
     * 未找到班级信息
     */
    SSK_40002,
    /**
     * 未找到班型信息
     */
    SSK_40003,
    /**
     * 未找到讲次信息
     */
    SSK_40004,
    /**
     * 未找到授课时段
     */
    SSK_40005,
    /**
     * 未找到课表信息
     */
    SSK_40006,
    /**
     * scoreType not support's type
     */
    SSK_40007,
    /**
     * homeworkApi call fail
     */
    SSK_40008,
    /**
     * 找不到题目
     */
    SSK_40009,
    /**
     * 未找到班级讲次任务
     */
    SSK_40010,
    /**
     * topicIds not found by classId and lessonId
     */
    SSK_40011,
    /**
     * klibIds not found by topicIds
     */
    SSK_40012,
    /**
     * select stuInfoList size = 0 by classId
     */
    SSK_40013,
    /**
     * 更新课表这节课结束时间不能晚于下节课开始时间
     */
    SSK_40014,
    /**
     * 查询class lesson task list erro
     */
    SSK_40110,
    /**
     * 获取讲次任务明细异常
     */
    SSK_40111,
    /**
     * 更新任务状态失败
     */
    SSK_40112,
    /**
     * 手机号不能为空
     */
    GODF_30001,
    /**
     * 密码不能为空
     */
    GODF_30002,
    /**
     * 机构编号不能为空
     */
    GODF_30003,
    /**
     * 图片下载异常
     */
    GODF_30004,
    /**
     * 机构信息不存在
     */
    GODF_30005,
    /**
     * 用户名或密码错误
     */
    GODF_30006,

    /*
      双师相关错误码.
     */
    DT_10001,
    DT_10002,
    DT_10003,
    DT_10004,
    DT_10005,
    DT_10006,
    DT_10007,
    DT_10008,
    DT_10009,
    DT_20001,
    DT_20002,
    DT_20003,
    DT_20004,
    DT_20005,
    DT_20006,
    DT_20007,
    DT_20008,
    DT_20009,

    /**
     * 双师课堂班级Id为空.
     */
    DT_30001,

    /**
     * 双师课堂讲次Id为空.
     */
    DT_30002,

    /**
     * 双师课堂学生Id为空.
     */
    DT_30003,

    /**
     * 无双师课堂讲次数据.
     */
    DT_30004,

    /**
     * 未获得学生本讲次答题的积分和金币的基本数据.
     */
    DT_30005,

    /**
     * 单讲次课件题目为空.
     */
    DT_30006,

    /**
     * 基础数据同步错误.
     */
    DT_30007

}
